Repository: uygardgn/ba-campusapp-backend
Catalog: src/WebApi/BACampusApp.Business/Resource.*.resx
Languages: tr_tr

# Trainer_Has_Not_Found
source: Trainer not found !
tr_tr: Eğitmen bulunamadı !

source: Trainer is not active !
tr_tr: Eğitmen aktif değil !

# Trainer_LastName_Matches
source: Surname Must Be Only Letters!
tr_tr: Soyad Sadece Harflerden Oluşmalıdır !

# Trainer_LastName_MaxLength
source: Surname Cannot Be More Than 50 Characters !
tr_tr: Soyad 50 Karakterden Fazla Olamaz !

# Trainer_LastName_MinLength
source: Surname Cannot Be Less Than 2 Characters !
tr_tr: Soyad 2 Karakterden Az Olamaz !

# Trainer_LastName_Not_Empty
source: Surname Field Cannot Be Empty!
tr_tr: Soyad Alanı Boş Geçilemez !

# Trainer_Phone_Number_Matches
source: Please enter a correct phone number !
tr_tr: Lütfen doğru bir telefon numarası giriniz !

# Trainer_Phone_Number_Min_Length
source: Please enter a phone number of at least 7 digits !
tr_tr: Lütfen en az 7 haneli bir telefon numarası giriniz !

# TUnits_Name_Length
source: Please enter the technical unit field between 2 and 35 characters !
tr_tr: Lütfen teknik birim alanını 2 ile 35 karakter arasında giriniz !

# TUnits_Name_Not_Empty
source: You did not enter the technical unit name !
tr_tr: Teknik birim adını girmediniz !

source: Update fail !
tr_tr: Güncelleme başarısız !

source: Update success !
tr_tr: Güncelleme başarılı !

source: Username or password is wrong !
tr_tr: Kullanıcı adı veya şifre hatalı !

# UserPasswords_Has_Not_Found
source: UserPasswords not found !
tr_tr: UserPasswords bulunamadı !

source: User has not found !
tr_tr: Kullanıcı bulunamadı !

# Sub_Category_Can_Not_Delete
source: There is a Education for the Sub Category. You cannot delete the Sub Category!
tr_tr: Alt kategoriye ait Eğitim bulunuyor. Alt kategoriyi silemezsiniz!

# Training_Type_Name_Invalid
source: Training Type Cannot Contain Numbers and Special Characters !
tr_tr: Eğitim Tipi Sayı ve Özel Karakter İçeremez !

# Training_Type_Name_Length
source: Training Type Must Consist of Min 2 Max 35 Characters !
tr_tr: Eğitim Tipi En Az 2 En Fazla 35 Karakterden Oluşmalıdır !

# Training_Type_Name_Not_Empty
source: Training Type Cannot Be Left Blank !
tr_tr: Eğitim Tipi Boş Geçilemez

# Branch_Name_Invalid
source: Branch Name Cannot Contain Numbers and Special Characters !
tr_tr: Şube Adı Sayı ve Özel Karakter İçeremez !

# Branch_Name_Length
source: Branch Name Must Consist of Min 2 Max 35 Characters !
tr_tr: Şube Adı En Az 2 En Fazla 35 Karakterden Oluşmalıdır !

# Branch_Name_Not_Empty
source: Branch Name Cannot Be Left Blank !
tr_tr: Şube Adı Boş Geçilemez !

# Group_Type_Name_Invalid
source: Please do not use special characters !
tr_tr: Lütfen özel karakter kullanmayınız !

# Group_Type_Name_Length
source: Please enter the group type field between 2 and 35 characters !
tr_tr: Grup tipi alanını 2 ile 35 karakter arasında giriniz !

# Group_Type_Name_Not_Empty
source: You did not enter the group type name !
tr_tr: Grup tipi alanı boş geçilemez !

# Video_Duration_Is_Not_Valid
source: The uploaded video cannot exceed the time limit !
tr_tr: Video süresi sınırı aşamaz !

# Video_Size_Is_Not_Valid
source: You cannot exceed the uploaded video size limit !
tr_tr: Video boyutu sınırı aşamaz !

# File_Could_Not_Be_Recovered
source: File couldn't be recovered !
tr_tr: Dosya kurtarılamadı !

# Non_Existent_Directory
source: File path could not be found !
tr_tr: Dosya yolu bulunamadı !

# Supplementary_Resource_Educations_Not_Null
source: You did not enter education information for the helpful resource !
tr_tr: Yardımcı kaynak için eğitim bilgisi girmediniz !

# Supplementary_Resource_Name_Length
source: Please enter the name field between 2 and 128 characters !
tr_tr: Kaynak Adı En Az 2 En Fazla 128 Karakterden Oluşmalıdır !

# Supplementary_Resource_Subjects_Not_Null
source: You did not enter subject information for the helpful resource !
tr_tr: Yardımcı kaynak için konu bilgisi girmediniz !

# Link_Format_Fail
source: The link is not in a valid format
tr_tr: Girilen link geçerli formatta değildir!

# Admin_Address_Length
source: Please enter the address field between 2 and 256 characters !
tr_tr: Lütfen adres alanını 2 ile 256 karakter arasında giriniz !

# Admin_Address_Not_Null
source: You did not enter the address !
tr_tr: Adres alanını girmediniz !

# Student_Address_Length
source: Please enter the address field between 2 and 256 characters !
tr_tr: Lütfen adres alanını 2 ile 256 karakter arasında giriniz !

# Student_Address_Not_Null
source: You did not enter the address !
tr_tr: Adres alanını girmediniz !

# Trainer_Address_Length
source: Please enter the address field between 2 and 256 characters !
tr_tr: Lütfen adres alanını 2 ile 256 karakter arasında giriniz !

# Trainer_Address_Not_Null
source: You did not enter the address !
tr_tr: Adres alanını girmediniz !
