Repository: uygardgn/ba-campusapp-backend
Catalog: src/WebApi/BACampusApp.Business/Resource.*.resx
Languages: tr_tr

source: ActivityStateLog Has Not Found!
tr_tr: Aktivite durumu bulunamadı!

source: Activity status adding fail !
tr_tr: Aktivite durumu eklenemedi !

source: Adding failed !
tr_tr: Ekleme başarısız !

source: Adding succeed !
tr_tr: Ekleme başarılı !

# Admin_Country_Code_Control
source: Country Code entered incorrectly !
tr_tr: Ülke Kodu hatalı girildi !

# Admin_Country_Code_Length
source: Country Code can be a maximum of 2 digits !
tr_tr: Ülke Kodu en fazla 2 haneli olabilir !

# Admin_Date_Of_Birth_GreaterThan
source: Please enter a valid date of birth. You cannot be older than 65 !
tr_tr: Lütfen geçerli bir doğum tarihi giriniz. 65 yaşından büyük olamazsınız !

# Admin_Date_Of_Birth_LessThan
source: Please enter a valid date of birth. You cannot be under the age of 18 !
tr_tr: Lütfen geçerli bir doğum tarihi giriniz. 18 yaşından küçük olamazsınız !

# Admin_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Admin_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# Admin_FirstName_Length
source: Please enter the name field between 2 and 256 characters !
tr_tr: Lütfen isim alanını 2 ile 256 karakter arasında giriniz !

# Admin_FirstName_Matches
source: Please enter only letters in the name field !
tr_tr: Lütfen isim alanına sadece harf giriniz !

# Admin_FirstName_Not_Null
source: You did not enter the namespace !
tr_tr: İsim alanını girmediniz !

# Admin_Gender_Control
source: Enter a valid gender value !
tr_tr: Geçerli bir cinsiyet değeri giriniz !

source: Admin has not found!
tr_tr: Admin bulunamadı !

# Admin_LastName_Length
source: Please enter the surname field between 2 and 256 characters !
tr_tr: Lütfen soyisim alanını 2 ile 256 karakter arasında giriniz !

# Admin_LastName_Matches
source: Please enter only letters in the surname field !
tr_tr: Lütfen soyisim alanına sadece harf giriniz !

# Admin_LastName_Not_Null
source: You did not enter the last name field !
tr_tr: Soyisim alanını girmediniz !

# Admin_Phone_Number_Length
source: Please enter a phone number of at least 7 digits !
tr_tr: Lütfen en az 7 haneli bir telefon numarası giriniz !

# Admin_Phone_Number_Matches
source: Please enter a correct phone number !
tr_tr: Lütfen doğru bir telefon numarası giriniz !

source: Already adding failed !
tr_tr: Bu veri zaten var !

source: Branch already exists !
tr_tr: Bu şube zaten mevcut !

source: Branch Not Found !
tr_tr: Şube bulunamadı !

# Cannot_Be_One_Of_The_Last_Three_Passwords
source: Password cannot be one of the last three passwords !
tr_tr: Şifre son 3 şifreden biri olamaz !

source: Casting is not completed !
tr_tr: Casting tamamlanamadı !

source: Category has not found !
tr_tr: Kategori bulunamadı !

# Category_Length
source: Please enter the category field between 2 and 35 characters !
tr_tr: Lütfen kategori alanını 2 ile 35 karakter arasında giriniz !

# Category_Matches
source: Please do not use special characters !
tr_tr: Lütfen özel karakterler kullanmayınız !

# Category_Not_Empty
source: You did not enter the category name !
tr_tr: Kategori adını girmediniz !

# ChangePassword_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# ChangePassword_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# ChangePassword_New_Password_Again_Equal
source: Passwords do not match !
tr_tr: Şifreler eşleşmiyor !

# ChangePassword_New_Password_Again_Not_Empty
source: You must enter the New Password Repeat !
tr_tr: Yeni Şifre Tekrarını girmelisiniz !

# ChangePassword_New_Password_Not_Empty
source: You must enter the new password !
tr_tr: Yeni Şifreyi girmelisiniz !

# ChangePassword_Old_Password_Not_Empty
source: You must enter the old password !
tr_tr: Eski Şifreyi Girmelisiniz !

# Classroom_Activity_Has_Not_Changed
source: Classroom activity status is not changed !
tr_tr: Sınıf aktivitesi değişmedi !

source: Classroom already exists !
tr_tr: Bu sınıf zaten mevcut !

# Classroom_Closed_Date_Control
source: Class closing date must be a future date !
tr_tr: Sınıf kapanma tarihi ileri bir tarih olmalıdır !

# Classroom_Closed_Date_Not_Empty
source: Class closing date cannot be empty !
tr_tr: Sınıf kapanma tarihi boş olamaz !

# Classroom_Education_Id_Not_Empty
source: Training field cannot be empty !
tr_tr: Eğitim alanı boş olamaz !

source: Classroom has not found !
tr_tr: Sınıf bulunamadı !

# Classroom_Id_Not_Empty
source: Id information cannot be left blank !
tr_tr: Id bilgisi boş bırakılamaz !

source: Classroom is not active !
tr_tr: Bu sınıf aktif değil !

# Classroom_Name_Length
source: Class name cannot be less than 2 characters and not more than 50 characters!
tr_tr: Sınıf adı 2 karakterden az 50 karakterden fazla olamaz !

# Classroom_Name_Not_Empty
source: Class name cannot be empty !
tr_tr: Sınıf adı boş olamaz !

# Classroom_Open_Date_First_Control
source: The class start date must be a future date !
tr_tr: Sınıf başlangıç tarihi ileri bir tarih olmalıdır !

# Classroom_Open_Date_Not_Empty
source: Class opening date cannot be empty !
tr_tr: Sınıf açılma tarihi boş olamaz !

# Classroom_Open_Date_Second_Control
source: Class opening date cannot be later than end date !
tr_tr: Sınıf açılış tarihi bitiş tarihinden sonra olamaz !

source: Classroom student activity status has not changed !
tr_tr: Sınıfa kayıtlı öğrenci aktivitesi değişmedi !

# Classroom_Student_Classroom_Id_Not_Empty
source: Class field cannot be left blank !
tr_tr: Sınıf alanı boş bırakılamaz !

# Classroom_Student_End_Date_Control
source: The end date must be the next date !
tr_tr: Bitiş tarihi ileri tarih olmalıdır !

# Classroom_Student_End_Date_Not_Empty
source: The end date field cannot be left blank !
tr_tr: Bitiş tarihi alanı boş bırakılamaz !

source: Classroom student has not found !
tr_tr: Bu sınıftaki öğrenci bulunamadı !

# Classroom_Student_Id_Not_Empty
source: ID Cannot be empty !
tr_tr: ID Boş Olamaz !

# Classroom_Student_Start_Date_First_Control
source: The start date must be the next date !
tr_tr: Başlangıç tarihi ileri tarih olmalıdır !

# Classroom_Student_Start_Date_Not_Empty
source: The start date field cannot be left blank !
tr_tr: Başlangıç tarihi alanı boş bırakılamaz !

# Classroom_Student_Start_Date_Second_Control
source: The start date cannot be later than the end date !
tr_tr: Başlangıç tarihi bitiş tarihinden sonra olamaz !

# Classroom_Student_Student_Id_Not_Empty
source: Student field cannot be left blank !
tr_tr: Öğrenci alanı boş bırakılamaz !

source: Classroom trainers has not found !
tr_tr: Eğitmen bulunamadı !

# Classroom_Trainer_Classroom_Id_Not_Empty
source: Class Id cannot be left blank !
tr_tr: Sınıf Id'si boş bırakılamaz !

# Classroom_Trainer_End_Date_Control
source: The end date must be the next date !
tr_tr: Bitiş tarihi ileri tarih olmalıdır !

# Classroom_Trainer_End_Date_Not_Empty
source: The end date field cannot be left blank!
tr_tr: Bitiş tarihi alanı boş bırakılamaz !

# Classroom_Trainer_Id_Not_Empty
source: ID cannot be Empty !
tr_tr: ID Boş Olamaz !

# Classroom_Trainer_Start_Date_Control
source: The start date must be the next date !
tr_tr: Başlangıç tarihi ileri tarih olmalıdır !

# Classroom_Trainer_Start_Date_Not_Empty
source: The start date field cannot be left blank !
tr_tr: Başlangıç tarihi alanı boş bırakılamaz !

# Classroom_Trainer_Trainer_Id_Not_Empty
source: Trainer ID cannot be left blank !
tr_tr: Eğitmen Id'si boş bırakılamaz !

source: Comment adding has succeed !
tr_tr: Yorum başarıyla eklendi !

# Comment_Content_Length
source: Please enter the comment field between 2 and 400 characters !
tr_tr: Lütfen yorum alanını 2 ile 400 karakter arasında giriniz !

# Comment_Content_Not_Null
source: You did not enter the comment field !
tr_tr: Yorum alanını girmediniz !

# Comment_Has_Not_Found
source: Comment not found !
tr_tr: Yorum bulunamadı !

# Comment_Item_Type_Control
source: Re-enter the commented object type (1 = Student, 2 = HomeWork, 3 = SupplementaryResource) !
tr_tr: Yorum yapılan nesne tipini (1 = Student, 2 = HomeWork, 3 = SupplementaryResource) olacak şekilde yeniden giriniz !

# Comment_Item_Type_Not_Null
source: Enter the commented object type !
tr_tr: Yorum yapılan nesne tipini giriniz !

# Comment_Title_Length
source: Please enter the comment subject field between 2 and 100 characters !
tr_tr: Lütfen yorum konusu alanını 2 ile 100 karakter arasında giriniz !

# Comment_Title_Not_Null
source: You did not enter the comment subject field !
tr_tr: Yorum konusu alanını girmediniz !

# Comment_User_Id_Not_Null
source: Enter the user who commented !
tr_tr: Yorum yapan kullanıcıyı giriniz !

source: Country code error !
tr_tr: Ülke kodu hatalı !

source: Deleting failed !
tr_tr: Silme başarısız !

source: Deleting succeed !
tr_tr: Silme başarılı !

source: Education already exists !
tr_tr: Bu eğitim zaten mevcut !

# Education_Category_Id_Not_Null
source: CategoryId cannot be empty !
tr_tr: CategoryId boş olamaz !

# Education_Course_Hours_Control
source: Training hour must be between 1 and 1000 !
tr_tr: Eğitim saati 1 ile 1000 arasında olmalıdır !

# Education_Course_Hours_Not_Empty
source: The training hour cannot be empty !
tr_tr: Eğitim saati boş olamaz !

# Education_Description_Length
source: Please enter the description between 1 and 1200 characters !
tr_tr: Lütfen açıklamayı 1 ile 1200 karakter arasında giriniz !

# Education_Description_Not_Empty
source: Training description cannot be empty !
tr_tr: Eğitim açıklaması boş olamaz !

# Education_Has_Classrooms
source: Trainings with at least one active cannot be deleted !
tr_tr: İçinde en az bir aktif bulunan eğitimler silinemez !

# Education_Name_Length
source: Please enter the training name between 2 and 50 characters !
tr_tr: Lütfen eğitim adını 2 ile 50 karakter arasında giriniz !

# Education_Name_Not_Empty
source: Education name cannot be empty !
tr_tr: Eğitim adı boş olamaz !

source: Education subject already exists !
tr_tr: Bu eğitim konusu zaten mevcut !

# Education_Subject_List_Has_Not
source: Education related subjects not found !
tr_tr: Eğitimle ilgili konular bulunamadı !

source: Education subject was not found !
tr_tr: Eğitim konusu bulunamadı !

source: Education was not found!
tr_tr: Eğitim bulunamadı !

# Feedback_Succeeded
source: Feedback given successfully !
tr_tr: Geri bildirim işlemi başarılı !

source: Found Success!
tr_tr: Bulundu !

# Homework_Can_Not_Be_Submitted
source: Homework due date has passed !
tr_tr: Ödev teslim tarihi geçti !

# Homework_Comment_Adding_Has_Succed
source: Homework comment adding has succeed !
tr_tr: Ödev yorumu başarıyla eklendi !

# HomeWork_End_Date_Control
source: Enter a future date !
tr_tr: Gelecek bir tarih giriniz !

# HomeWork_End_Date_Not_Empty
source: You did not enter the homework due date !
tr_tr: Ödev bitis tarihini girmediniz !

source: Homework has not found !
tr_tr: Ödev bulunamadı !

# HomeWork_Intructions_Length
source: Please enter the assignment name between 2 and 128 characters !
tr_tr: Lütfen Ödev adını 2 ile 100 karakter arasında giriniz !

# HomeWork_Is_Has_Point_Not_Null
source: Please select the grading status of the assignment !
tr_tr: Lütfen ödevin puanlandırılma durumunu seçiniz !

# HomeWork_Is_Late_Turned_In_Not_Null
source: Please specify the late submission/non-delivery rule of the assignment !
tr_tr: Lütfen ödevin geç teslim edilme/edilmeme kuralını belirtiniz !

source: Homework not yet submitted !
tr_tr: Ödev henüz teslim edilmedi !

# HomeWork_Referance_File_Size_Control
source: You have exceeded the 10 MB limit!
tr_tr: 10 MB sınırını aştınız !

# HomeWork_Start_Date_First_Control
source: Past dates are not accepted !
tr_tr: Geçmiş tarihler kabul edilmiyor !

# HomeWork_Start_Date_Not_Empty
source: You did not enter the homework start date !
tr_tr: Ödev baslangic tarihini girmediniz !

# HomeWork_Start_Date_Second_Control
source: The homework start date cannot be greater than the due date !
tr_tr: Ödev başlangıç tarihi bitiş tarihinden büyük olamaz !

source: Homework subject has not found !
tr_tr: Ödev konusu bulunamadı !

# HomeWork_Subject_Id_Not_Null
source: Homework subject cannot be empty !
tr_tr: Ödev konusu boş olamaz !

# HomeWork_Title_Length
source: Please enter the assignment name between 2 and 128 characters !
tr_tr: Lütfen Ödev adını 2 ile 128 karakter arasında giriniz !

# HomeWork_Title_Not_Empty
source: Assignment title cannot be empty !
tr_tr: Ödev başlığı boş olamaz !

source: Homework update has not found !
tr_tr: Ödev güncellemesi bulunamadı !

source: Incorrect operation !
tr_tr: İşlem yanlış !

source: ItemId has not found !
tr_tr: ItemID bulunamadı !

source: Item type is not correct !
tr_tr: Öğe türü doğru değil !

source: Listed fail !
tr_tr: Listelenemedi !

source: Listed success !
tr_tr: Listelendi !

source: List has no elements !
tr_tr: Listede element mevcut değil !

# Login_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Login_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# Login_Password_Not_Empty
source: You must enter a password !
tr_tr: Şifre girmelisiniz !

source: No file uploaded to the homework !
tr_tr: Ödev için dosya yüklenmemiştir !

source: Old password is incorrect !
tr_tr: Eski şifreniz yanlış !

source: Passwords do not match !
tr_tr: Şifreler eşleşmiyor !

source: Password has changed successfully !
tr_tr: Şifre Başarıyla Değişti !

# Password_Match_Fail
source: Passwords do not match !
tr_tr: Parolalar Eşleşmiyor !

source: Password reset successfully and new password has send to your e-mail!
tr_tr: Şifre Başarıyla Sıfırlandı ve Yeni Şifre E-Mail Adresinize Gönderildi !

source: Phone number error !
tr_tr: Telefon numarası hatalı !

# Reset_Password_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Reset_Password_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# Reset_Password_Fail
source: Password reset failed !
tr_tr: Parola yenileme başarısız !

source: Resource tag has not found !
tr_tr: Kaynak etiketi bulunamadı !

# Response_Success
source: Your answer has been added successfully!
tr_tr: Yanıtınız başarıyla eklendi!

# RoleLog_Has_Not_Found
source: RoleLog not found !
tr_tr: RoleLog bulunamadı !

source: Same e-mail address has already used!
tr_tr: Sisteme kayıtlı bir e-mail adresi girdiniz !

# StudentHomework_Feedback_Id_Not_Null
source: You must enter a student assignment number !
tr_tr: Bir öğrenci ödev numarası girmelisiniz !

# Student_Active_Description_Max_Length
source: Description Cannot Be More Than 256 Characters !
tr_tr: Açıklama 256 Karakterden Fazla Olamaz !

# Student_Active_Description_Min_Length
source: Description Cannot Be Less Than 2 Characters !
tr_tr: Açıklama 2 Karakterden Az Olamaz !

# Student_Active_Description_Not_Empty
source: Description Field Cannot Be Empty!
tr_tr: Açıklama Alanı Boş Geçilemez !

# Student_Active_Id_Not_Empty
source: ID Field Cannot Be Empty !
tr_tr: ID Alanı Boş Geçilemez !

# Student_Activity_Status_Has_Not_Changed
source: Student activity has not changed !
tr_tr: Öğrenci aktivite durumu değişmedi !

source: Student already exists!
tr_tr: Öğrenci zaten var!

source: Student already exists in classroom !
tr_tr: Bu öğrenci zaten sınıfa kayıtlı !

source: Student already exists in homework !
tr_tr: Öğrenci ödevde zaten mevcut !

source: Student comment add success !
tr_tr: Öğrenci yorumu başarıyla eklendi !

# Student_Country_Control
source: Country Code entered incorrectly !
tr_tr: Ülke Kodu hatalı girildi !

# Student_Country_Length
source: Country Code can be a maximum of 2 digits !
tr_tr: Ülke Kodu en fazla 2 haneli olabilir !

# Student_Date_Of_Birth_Control
source: You Must Be Over 18 or Under 65 to Register !
tr_tr: Kayıt Yapmak İçin 18 Yaşından Büyük veya 65 Yaşından Küçük Olmalısınız !

# Student_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Student_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# Student_FirstName_Matches
source: Your Name Must Have Only Letters!
tr_tr: Adınız Sadece Harflerden Oluşmalıdır!

# Student_FirstName_Max_Length
source: Your Name Cannot Be More Than 50 Characters !
tr_tr: Adınız 50 Karakterden Fazla Olamaz !

# Student_FirstName_Min_Length
source: Your Name Cannot Be Less Than 2 Characters !
tr_tr: Adınız 2 Karakterden Az Olamaz !

# Student_FirstName_Not_Empty
source: Name Field Cannot Be Empty !
tr_tr: Ad Alanı Boş Geçilemez !

# Student_HomeWork_HomeWork_Id_Not_Null
source: You must enter an assignment number !
tr_tr: Bir ödev numarası girmelisiniz !

# Student_HomeWork_Homework_State_Not_Null
source: You must specify an assignment status !
tr_tr: Bir ödev durumu belirtmelisiniz !

# Student_HomeWork_Id_Not_Null
source: You must enter a student assignment number !
tr_tr: Bir öğrenci ödev numarası girmelisiniz !

# Student_HomeWork_Point_Control
source: The assignment score must be between 0 and 100 !
tr_tr: Ödev puanı 0 ile 100 arasında olmalıdır !

# Student_HomeWork_Point_Id_Not_Null
source: You must enter a student assignment number !
tr_tr: Bir öğrenci ödev numarası girmelisiniz !

# Student_HomeWork_Point_Point_Not_Null
source: You must enter an assignment score !
tr_tr: Bir ödev puanı girmelisiniz !

# Student_HomeWork_Student_Attached_File_Not_Empty
source: File upload is mandatory !
tr_tr: Dosya yükleme zorunludur !

# Student_HomeWork_Student_Attached_File_Size_Control
source: You have exceeded the 10 MB limit !
tr_tr: 10 MB sınırını aştınız !

# Student_HomeWork_Student_Id_Not_Empty
source: You must enter a student assignment number !
tr_tr: Bir öğrenci ödev numarası girmelisiniz !

# Student_HomeWork_Student_Id_Not_Null
source: You must enter a student number !
tr_tr: Bir öğrenci numarası girmelisiniz !

# Student_HomeWork_Trainer_Attached_File_Size_Control
source: You have exceeded the 10 MB limit!
tr_tr: 10 MB sınırını aştınız !

# Student_HomeWork_Trainer_HomeWork_Id_Not_Null
source: You must enter an assignment number!
tr_tr: Bir ödev numarası girmelisiniz !

# Student_HomeWork_Trainer_Id_Not_Null
source: You must enter a student assignment number !
tr_tr: Bir öğrenci ödev numarası girmelisiniz !

# Student_HomeWork_Trainer_Point_Control
source: The assignment score must be between 0 and 100 !
tr_tr: Ödev puanı 0 ile 100 arasında olmalıdır !

# Student_HomeWork_Trainer_Student_Id_Not_Null
source: You must enter a student number !
tr_tr: Bir öğrenci numarası girmelisiniz !

# Student_LastName_Matches
source: Surname Must Be Only Letters !
tr_tr: Soyad Sadece Harflerden Oluşmalıdır !

# Student_LastName_Max_Length
source: Surname Cannot Be More Than 50 Characters !
tr_tr: Soyad 50 Karakterden Fazla Olamaz !

# Student_LastName_Min_Length
source: Surname Cannot Be Less Than 2 Characters !
tr_tr: Soyad 2 Karakterden Az Olamaz !

# Student_LastName_Not_Empty
source: Surname Field Cannot Be Empty!
tr_tr: Soyad Alanı Boş Geçilemez !

source: Student not active !
tr_tr: Öğrenci aktif değil !

# Student_Phone_Number_Length
source: Please enter a phone number of at least 7 digits !
tr_tr: Lütfen en az 7 haneli bir telefon numarası giriniz !

# Student_Phone_Number_Matches
source: Please enter a correct phone number !
tr_tr: Lütfen doğru bir telefon numarası giriniz !

source: Subject already exists !
tr_tr: Bu konu zaten mevcut !

source: Subject has not found !
tr_tr: Konu bulunamadı !

# Subject_Name_Length
source: Please enter the name field between 2 and 128 characters !
tr_tr: Lütfen isim alanını 2 ile 128 karakter arasında giriniz !

# Subject_Name_Matches
source: Please do not use special characters !
tr_tr: Lütfen özel karakterler kullanmayınız !

# Subject_Name_Not_Empty
source: You did not enter the subject name !
tr_tr: Konu adını girmediniz !

# SupplementaryResource_File_URL_Not_Empty
source: You did not enter the resource path information for the auxiliary resource !
tr_tr: Yardımcı kaynak için kaynak yolu bilgisi girmediniz !

# SupplementaryResource_Id_Not_Empty
source: Id field cannot be left blank !
tr_tr: Id alanı boş bırakılamaz !

# SupplementaryResource_Name_Not_Empty
source: You did not enter the auxiliary resource name !
tr_tr: Yardımcı kaynak adını girmediniz !

# SupplementaryResource_Resource_Type_Control
source: Source type must be 1 (document) or 2 (video) !
tr_tr: Kaynak tipi 1 (document) veya 2 (video) olmalıdır !

# SupplementaryResource_SupplementaryResource_Id_Not_Empty
source: Auxiliary resource field cannot be left blank !
tr_tr: Yardımcı kaynak alanı boş bırakılamaz !

# SupplementaryResource_Tags_Not_Null
source: You did not enter tag information for the helpful resource !
tr_tr: Yardımcı kaynak için etiket bilgisi girmediniz !

# SupplementaryResource_Tag_Id_Not_Empty
source: Label field cannot be left blank!
tr_tr: Etiket alanı boş bırakılamaz !

source: Supplementary resource already exists !
tr_tr: Yardımcı kaynak zaten mevcut !

source: Supplementary resource has not found !
tr_tr: Yardımcı kaynak bulunamadı !

source: Supplementary resource tag has not found !
tr_tr: Yardımcı kaynak etiketi bulunamadı !

source: Tag is not found !
tr_tr: Etiket bulunamadı !

source: Tag name already exists !
tr_tr: Etiket ismi zaten mevcut !

# Tag_Name_Length
source: Please enter the tag name field between 1 and 128 characters !
tr_tr: Lütfen etiket adı alanını 1 ile 128 karakter arasında giriniz !

# Tag_Name_Not_Empty
source: You did not enter the tag name !
tr_tr: Etiket adını girmediniz !

# Tag_Name_Not_Matches
source: Please do not use special characters !
tr_tr: Lütfen özel karakterler kullanmayınız !

# Tag_Not_Found
source: Tag has not found !
tr_tr: Etiket bulunamadı !

source: Technical units already exists !
tr_tr: Bu teknik birim zaten mevcut !

source: Technical units have not found !
tr_tr: Teknik birim bulunamadı !

# Tecnical_Unit_Can_Not_Delete
source: There is a category for the Technical Unit, you cannot delete the technical unit!
tr_tr: Teknik Birime ait katagori bulunuyor teknik birimi silemezsiniz

source: This homework is graded !
tr_tr: Bu puanlı bir ödevdir !

source: Token created successfully !
tr_tr: Token başarıyla oluşturuldu !

source: Trainer activity has not changed !
tr_tr: Eğitmen aktivitesi değişmedi !

source: Trainer already exists !
tr_tr: Bu eğitmen zaten mevcut !

source: Trainer already exists in classroom !
tr_tr: Bu Sınıfa Kayıtlı Bir Eğitmen Girdiniz!

source: Trainer and student cannot be the same person!
tr_tr: Eğitmen ve öğrenciyi aynı sınıfa ekleyemezsiniz!

# Trainer_Country_Control
source: Country Code entered incorrectly !
tr_tr: Ülke Kodu hatalı girildi !

# Trainer_Country_Max_Length
source: Country Code can be a maximum of 2 digits !
tr_tr: Ülke Kodu en fazla 2 haneli olabilir !

# Trainer_Date_Of_Birth_Control
source: You Must Be Over 18 or Under 65 to Register !
tr_tr: Kayıt Yapmak İçin 18 Yaşından Büyük veya 65 Yaşından Küçük Olmalısınız !

# Trainer_Email_Control
source: Please enter a valid e-mail address!
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Trainer_Email_Not_Empty
source: You must enter an e-mail address!
tr_tr: Mail adresi girmelisiniz !

# Trainer_FirstName_Matches
source: Your Name Must Have Only Letters!
tr_tr: Adınız Sadece Harflerden Oluşmalıdır !

# Trainer_FirstName_MaxLength
source: Your Name Cannot Be More Than 50 Characters!
tr_tr: Adınız 50 Karakterden Fazla Olamaz !

# Trainer_FirstName_MinLength
source: Your Name Cannot Be Less Than 2 Characters!
tr_tr: Adınız 2 Karakterden Az Olamaz !

# Trainer_FirstName_Not_Empty
source: Name Field Cannot Be Empty !
tr_tr: Ad Alanı Boş Geçilemez !
